# Tailored YOLO11s-pose for Rune Detection
# Parameters
nc: 2  # 4 classes: RedInactive, RedActive, BlueInactive, BlueActive
kpt_shape: [4, 3]  # 4 keypoints, (x,y,visibility)

scales:
  n: [0.50, 0.25, 1024]  # small model settings

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 1, ECA, [128]]                 # ✨新增 ECA after Conv128
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4

  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # upsample
  - [[-1, 6], 1, Concat, [1]]                  # cat backbone P4
  - [-1, 2, C3k2, [512, False]]                 # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]                  # cat backbone P3
  - [-1, 2, C3k2, [256, False]]                 # 16 (P3/8-small)
  - [-1, 1, CBAM, []]

  - [-1, 1, Conv, [256, 3, 2]]                  # down
  - [[-1, 13], 1, Concat, [1]]                  # cat head P4
  - [-1, 2, C3k2, [512, False]]                 # 19 (P4/16-medium)
  - [-1, 1, CBAM, []]

  - [-1, 1, Conv, [512, 3, 2]]                  # down
  - [[-1, 10], 1, Concat, [1]]                  # cat head P5
  - [-1, 2, C3k2, [1024, True]]                 # 22 (P5/32-large)
  - [-1, 1, CBAM, []]

  - [[16, 19, 22], 1, Pose, [nc, kpt_shape]]     # Detect head(P3,P4,P5)
